benchmarks/2026-05-31_16-50-20_pgbench_adaptive_adapt/pgbench_out.log
pgbench (18.3)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: simple
number of clients: 15
number of threads: 8
maximum number of tries: 1
number of transactions per client: 3000
number of transactions actually processed: 45000/45000
number of failed transactions: 0 (0.000%)
latency average = 5.524 ms
initial connection time = 10.847 ms
tps = 2715.660235 (without initial connection time)